name: Cisco Secure Firewall - Blocked Connection
id: 17e9b764-3a2b-4d36-9751-32d13ce4718b
version: 1
date: '2025-04-01'
author: Nasreddine Bencherchali, Splunk
status: production
type: Anomaly
description: The following analytic detects a blocked connection event by
  identifying a "Block" value in the AC_RuleAction field. It leverages logs from Cisco Secure Firewall Threat Defense devices. This activity is significant as it can identify attempts from users or applications initiating network connection to explicitly or implicitly blocked range or zones. If confirmed malicious, attackers could be attempting to perform a forbidden action on the network such as data exfiltration, lateral movement, or network disruption.
data_source:
- Cisco Secure Firewall Threat Defense Connection Event
search: |
  `cisco_secure_fw` EventType=ConnectionEvent AC_RuleAction=Block
  | stats count min(_time) as firstTime max(_time) as lastTime by InitiatorIP, InitiatorPort, ResponderIP, ResponderPort, Protocol, FirewallRule, URL, EVE_Process 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `cisco_secure_firewall__blocked_connection_filter`
how_to_implement: |
  This search requires Cisco Secure Firewall Threat Defense Logs, which
  includes the ConnectionEvent EventType. This search uses an input macro named `cisco_secure_fw`.
  We strongly recommend that you specify your environment-specific configurations
  (index, source, sourcetype, etc.) for Cisco Secure Firewall Threat Defense logs. Replace the macro definition
  with configurations for your Splunk environment. The search also uses a post-filter
  macro designed to filter out known false positives.
  The logs are to be ingested using the Splunk Add-on for Cisco Security Cloud (https://splunkbase.splunk.com/app/7404).
  The access policy must also enable logging.
known_false_positives: Blocked connection events are generated via an Access Control policy on the Firewall management console. Hence no false positives should be present.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
drilldown_searches:
- name: View the detection results for - "$InitiatorIP$"
  search: '%original_detection_search% | search  InitiatorIP = "$InitiatorIP$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$InitiatorIP$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$InitiatorIP$") starthoursago=168  | stats count min(_time)
    as firstTime max(_time) as lastTime values(search_name) as "Search Name" values(risk_message)
    as "Risk Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A connection request from $InitiatorIP$ to $ResponderIP$ has been blocked according to the configured firewall rule $FirewallRule$
  risk_objects:
  - field: InitiatorIP
    type: ip_address
    score: 25
  - field: ResponderIP
    type: ip_address
    score: 25
  - field: FirewallRule
    type: other
    score: 25
  threat_objects: []
tags:
  analytic_story:
  - Cisco Secure Firewall Threat Defense Analytics
  asset_type: Network
  mitre_attack_id:
    - T1018
    - T1046
    - T1110
    - T1203
    - T1595.002
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: network
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/cisco_secure_firewall_threat_defense/connection_event/connection_events.log
    sourcetype: cisco:sfw:estreamer
