name: Cisco Configuration File Exfiltration Attempts
id: 27653720-0e11-4585-b975-5fa394a35ea2
version: 1
date: '2025-08-21'
author: Bhavin Patel, Michael Haag, Splunk
status: production
type: TTP
description: This analytic detects attempts to exfiltrate Cisco device configuration files via TFTP to external servers. After gaining access to network devices, threat actors like Static Tundra often attempt to copy sensitive configuration files (startup-config, running-config) to external TFTP servers to extract credentials, network topology information, and other sensitive data. This detection looks for the specific command patterns used when attempting to copy configuration files to external locations, which is a critical step in data theft operations targeting network infrastructure.
data_source:
- Cisco IOS Logs
search: '| tstats `security_content_summariesonly` count values(All_Changes.command) as commands min(_time) as firstTime max(_time) as lastTime from datamodel=Change.All_Changes 
  where sourcetype="cisco:ios" 
  AND (
    (All_Changes.command="*copy*startup-config*tftp*") OR 
    (All_Changes.command="*copy*running-config*tftp*") OR
    (All_Changes.command="*CONFIG_I: Configured from console*" AND All_Changes.command="*tftp*")
  )
  by All_Changes.dvc All_Changes.user
| `drop_dm_object_name("All_Changes")`
| rename dvc as dest
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `cisco_configuration_file_exfiltration_attempts_filter`'
how_to_implement: To implement this search, you need to be ingesting Cisco IOS logs with the sourcetype "cisco:ios" and have these logs mapped to the Change datamodel. Ensure that your Cisco IOS devices are configured to send logs to your Splunk environment, with appropriate logging levels enabled to capture configuration commands and system messages. Configure logging on Cisco IOS devices using the "logging trap informational" and "archive log config logging enable" commands to ensure that configuration changes and copy commands are properly logged.
known_false_positives: Legitimate configuration backups may trigger this detection. Network administrators often copy configuration files to backup servers as part of routine maintenance or before making significant changes. To reduce false positives, consider implementing a baseline of expected administrative activities, including approved administrative usernames, authorized backup server IP addresses, and scheduled backup windows. You may also want to create a lookup table of approved backup destinations to filter out alerts for these locations.
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/fundamentals/command/cf_command_ref/A_through_B.html#wp1558044134
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time)
    as firstTime max(_time) as lastTime values(search_name) as "Search Name" values(risk_message)
    as "Risk Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Potential configuration file exfiltration attempt detected on Cisco device $dest$ by user $user$, which may indicate data theft activity
  risk_objects:
  - field: dest
    type: system
    score: 70
  - field: user
    type: user
    score: 50
  threat_objects:
  - field: commands
    type: command
tags:
  analytic_story:
  - Cisco Smart Install Remote Code Execution CVE-2018-0171
  asset_type: Network
  mitre_attack_id:
  - T1567
  - T1005
  - T1048
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: network
  cve:
  - CVE-2018-0171
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/refs/heads/master/datasets/attack_techniques/T1190/cisco/cisco_smart_install/cisco_ios.log
    sourcetype: cisco:ios
    source: cisco:ios
