name: Windows InstallUtil Remote Network Connection
id: 4fbf9270-43da-11ec-9486-acde48001122
version: 12
date: '2025-03-27'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic detects the Windows InstallUtil.exe binary making
  a remote network connection. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and network telemetry. This activity is significant
  because InstallUtil.exe can be exploited to download and execute malicious code,
  bypassing application control mechanisms. If confirmed malicious, an attacker could
  achieve code execution, potentially leading to further system compromise, data exfiltration,
  or lateral movement within the network. Analysts should review the parent process,
  network connections, and any associated file modifications to determine the legitimacy
  of this activity.
data_source:
- Sysmon EventID 1 AND Sysmon EventID 3
search: "| tstats prestats=t `security_content_summariesonly` count FROM datamodel=Endpoint.Processes\n\
  \  where `process_installutil`\n  by Processes.action Processes.dest Processes.original_file_name\
  \ Processes.parent_process Processes.parent_process_exec \n  Processes.parent_process_guid\
  \ Processes.parent_process_id Processes.parent_process_name \n  Processes.parent_process_path\
  \ Processes.process Processes.process_exec Processes.process_guid Processes.process_hash\
  \ \n  Processes.process_id Processes.process_integrity_level Processes.process_name\
  \ Processes.process_path \n  Processes.user Processes.user_id Processes.vendor_product\
  \ \n| `drop_dm_object_name(Processes)` \n| tstats prestats=t append=t `security_content_summariesonly`\
  \ count min(_time) as firstTime max(_time)\n  as lastTime from datamodel=Network_Traffic.All_Traffic\
  \ where All_Traffic.dest_port!=0\n  by All_Traffic.action All_Traffic.app All_Traffic.dest\
  \ All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.direction \n  All_Traffic.dvc\
  \ All_Traffic.protocol All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip\
  \ All_Traffic.src_port \n  All_Traffic.transport All_Traffic.user All_Traffic.vendor_product\
  \ All_Traffic.process_id\n| `drop_dm_object_name(All_Traffic)` \n| table action\
  \ dest original_file_name parent_process parent_process_exec \n  parent_process_guid\
  \ parent_process_id parent_process_name \n  parent_process_path process process_exec\
  \ process_guid process_hash \n  process_id process_integrity_level process_name\
  \ process_path \n  user user_id vendor_product app dest_ip dest_port direction dvc\
  \ protocol \n  protocol_version src src_ip src_port transport \n| stats values(action)\
  \ as action values(dest) as dest values(original_file_name) as original_file_name\
  \ values(parent_process) as parent_process \n  values(parent_process_exec) as parent_process_exec\
  \ values(parent_process_guid) as parent_process_guid \n  values(parent_process_id)\
  \ as parent_process_id values(parent_process_name) as parent_process_name \n  values(parent_process_path)\
  \ as parent_process_path values(process) as process \n  values(process_exec) as\
  \ process_exec values(process_hash) as process_hash \n  values(process_guid) as\
  \ process_guid values(process_integrity_level) as process_integrity_level values(process_name)\
  \ as process_name\n  values(process_path) as process_path values(user) as user values(user_id)\
  \ as user_id \n  values(vendor_product) as vendor_product values(app) as app values(dest_ip)\
  \ as dest_ip values(dest_port) as dest_port values(direction) as direction\n  values(dvc)\
  \ as dvc values(protocol) as protocol values(protocol_version) as protocol_version\
  \ values(src) as src values(src_ip) as src_ip values(src_port) as src_port values(transport)\
  \ as transport by process_id \n| where isnotnull(process_name) AND isnotnull(dest_port)\
  \ \n| `windows_installutil_remote_network_connection_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Limited false positives should be present as InstallUtil is
  not typically used to download remote files. Filter as needed based on Developers
  requirements.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ generating a remote download.
  risk_objects:
  - field: user
    type: user
    score: 80
  - field: dest
    type: system
    score: 80
  threat_objects:
  - field: parent_process_name
    type: parent_process_name
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Living Off The Land
  - Compromised Windows Host
  - Signed Binary Proxy Execution InstallUtil
  asset_type: Endpoint
  mitre_attack_id:
  - T1218.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.004/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
